In [ ]:
import pandas as pd
import numpy as np

In [ ]:
x = ['a','b','c','d','e']
y = [1,2,3,4,5]
z={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [ ]:
pd.Series(data=x)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [ ]:
a=pd.Series(x)
a

0    a
1    b
2    c
3    d
4    e
dtype: object

In [ ]:
print(type(a))

<class 'pandas.core.series.Series'>

In [ ]:
b=pd.Series(x,y)
b

1    a
2    b
3    c
4    d
5    e
dtype: object

In [ ]:
b=pd.Series(x,index=y)
b # default is first data next index

1    a
2    b
3    c
4    d
5    e
dtype: object

In [ ]:
x=['a','b','e','d','c']
x2=['a','b','c','d','f']
y=[1,2,3,4,5]
a=pd.Series(y,x)
b=pd.Series(y,x2)
a+b

a    2.0
b    4.0
c    8.0
d    8.0
e    NaN
f    NaN
dtype: float64

In [ ]:
a['c':'e']

Series([], dtype: int64)

In [ ]:
a['e':'c']

e    3
d    4
c    5
dtype: int64

In [ ]:
a=[0,1,2,3,4]
b=[1,2,3,4,5]
c=[2,3,4,5,6]
d=[3,4,5,6,7]
e=[4,5,6,7,8]

df = pd.DataFrame([a,b,c,d,e],['a','b','c','d','e'],['col1','col2','col3','col4','col5'])
df

   col1  col2  col3  col4  col5
a     0     1     2     3     4
b     1     2     3     4     5
c     2     3     4     5     6
d     3     4     5     6     7
e     4     5     6     7     8

In [ ]:
a=[0,1,2,3,4]
b=[1,2,3,4,5]
c=[2,3,4,5,6]
d=[3,4,5,6,7]
e=[4,5,6,7,8]

df = pd.DataFrame([a,b,c,d,e],columns=['a','b','c','d','e'])
df

   a  b  c  d  e
0  0  1  2  3  4
1  1  2  3  4  5
2  2  3  4  5  6
3  3  4  5  6  7
4  4  5  6  7  8

In [ ]:
df['new_column'] = df['a']+df['b']
df

   a  b  c  d  e  new_column
0  0  1  2  3  4           1
1  1  2  3  4  5           3
2  2  3  4  5  6           5
3  3  4  5  6  7           7
4  4  5  6  7  8           9

In [ ]:
df.drop(2)

   a  b  c  d  e  new_column
0  0  1  2  3  4           1
1  1  2  3  4  5           3
3  3  4  5  6  7           7
4  4  5  6  7  8           9

In [ ]:
df

   a  b  c  d  e  new_column
0  0  1  2  3  4           1
1  1  2  3  4  5           3
2  2  3  4  5  6           5
3  3  4  5  6  7           7
4  4  5  6  7  8           9

In [ ]:
df=df.drop(2)

In [ ]:
df

   a  b  c  d  e  new_column
0  0  1  2  3  4           1
1  1  2  3  4  5           3
3  3  4  5  6  7           7
4  4  5  6  7  8           9

In [ ]:
df=df.drop(['new_column'],axis=1)
df

   a  b  c  d  e
0  0  1  2  3  4
1  1  2  3  4  5
3  3  4  5  6  7
4  4  5  6  7  8

In [ ]:
df.drop(['e'],axis=1,inplace=True)
df

   a  b  c  d
0  0  1  2  3
1  1  2  3  4
3  3  4  5  6
4  4  5  6  7

In [ ]:
df.loc[1:4,:]

   a  b  c  d
1  1  2  3  4
3  3  4  5  6
4  4  5  6  7

In [ ]:
df.iloc[:,:]

   a  b  c  d
0  0  1  2  3
1  1  2  3  4
3  3  4  5  6
4  4  5  6  7

In [ ]:
df.loc[3,'c']

5

In [ ]:
df[df>3]

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  4.0
3  NaN  4.0  5.0  6.0
4  4.0  5.0  6.0  7.0

In [ ]:
df[df['a']>2][['b','c']]

   b  c
3  4  5
4  5  6

In [ ]:
df[(df['a']>1) & (df['a']<4)]

   a  b  c  d
3  3  4  5  6

In [ ]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan],'d':[11,12,np.nan,np.nan,np.nan]}
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [11, 12, nan, nan, nan]}

In [ ]:
df=pd.DataFrame(d)
df

   a    b    c     d
0  1  6.0  0.0  11.0
1  2  7.0  1.0  12.0
2  3  8.0  2.0   NaN
3  4  9.0  NaN   NaN
4  5  NaN  NaN   NaN

In [ ]:
df.dropna(axis=0) #rows without na

   a    b    c     d
0  1  6.0  0.0  11.0
1  2  7.0  1.0  12.0

In [ ]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [ ]:
df.dropna()

   a    b    c     d
0  1  6.0  0.0  11.0
1  2  7.0  1.0  12.0

In [ ]:
df.fillna(1)

   a    b    c     d
0  1  6.0  0.0  11.0
1  2  7.0  1.0  12.0
2  3  8.0  2.0   1.0
3  4  9.0  1.0   1.0
4  5  1.0  1.0   1.0

In [ ]:
df.fillna(df['b'].mean())

   a    b    c     d
0  1  6.0  0.0  11.0
1  2  7.0  1.0  12.0
2  3  8.0  2.0   7.5
3  4  9.0  7.5   7.5
4  5  7.5  7.5   7.5

In [ ]:
p={'item':['apple','banana','apple','banana','apple'],'days':['January','February','March','April','May'],'salaries':[100,200,300,400,500]}
p

{'days': ['January', 'February', 'March', 'April', 'May'],
 'item': ['apple', 'banana', 'apple', 'banana', 'apple'],
 'salaries': [100, 200, 300, 400, 500]}

In [ ]:
p=pd.DataFrame(p)
p

     item      days  salaries
0   apple   January       100
1  banana  February       200
2   apple     March       300
3  banana     April       400
4   apple       May       500

In [ ]:
x=p.groupby('item')

In [ ]:
x.mean()

        salaries
item
apple        300
banana       300

In [ ]:
x.std()

          salaries
item
apple   200.000000
banana  141.421356

In [ ]:
x.sum()

        salaries
item
apple        900
banana       600

In [ ]:
x.count()

        days  salaries
item
apple      3         3
banana     2         2

In [ ]:
x.min()

           days  salaries
item
apple   January       100
banana    April       200

In [ ]:
x.describe()

       salaries
          count   mean         std    min    25%    50%    75%    max
item
apple       3.0  300.0  200.000000  100.0  200.0  300.0  400.0  500.0
banana      2.0  300.0  141.421356  200.0  250.0  300.0  350.0  400.0

In [ ]:
x.describe().transpose()

item            apple      banana
salaries count    3.0    2.000000
         mean   300.0  300.000000
         std    200.0  141.421356
         min    100.0  200.000000
         25%    200.0  250.000000
         50%    300.0  300.000000
         75%    400.0  350.000000
         max    500.0  400.000000

In [ ]:
x1={'a':[1,2,3],'b':[4,5,6]}
y1={'c':[7,8,9],'d':[10,11,12]}

x=pd.DataFrame(x1,index=['p1','p2','p3'])
y=pd.DataFrame(y1,index=['p1','p2','p3'])

In [ ]:
x

    a  b
p1  1  4
p2  2  5
p3  3  6

In [ ]:
y

    c   d
p1  7  10
p2  8  11
p3  9  12

In [ ]:
x.join(y)

    a  b  c   d
p1  1  4  7  10
p2  2  5  8  11
p3  3  6  9  12

In [ ]:
x1={'a':[1,2,3],'b':[4,5,6]}
y1={'c':[7,8,9],'d':[10,11,12]}

x=pd.DataFrame(x1,index=['p1','p2','p3'])
y=pd.DataFrame(y1,index=['p1','p4','p3'])

x.join(y,how='left')

    a  b    c     d
p1  1  4  7.0  10.0
p2  2  5  NaN   NaN
p3  3  6  9.0  12.0

In [ ]:
x.join(y,how='right')

      a    b  c   d
p1  1.0  4.0  7  10
p4  NaN  NaN  8  11
p3  3.0  6.0  9  12

In [ ]:
x.join(y,how='inner')

    a  b  c   d
p1  1  4  7  10
p3  3  6  9  12

In [ ]:
x1={'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
x2={'a':[10,11,12],'b':[13,14,15],'c':[16,17,18]}

df1=pd.DataFrame(x1,index=[1,2,3])
df2=pd.DataFrame(x2,index=[1,2,3])

pd.concat([df1,df2])

    a   b   c
1   1   4   7
2   2   5   8
3   3   6   9
1  10  13  16
2  11  14  17
3  12  15  18

In [ ]:
x1={'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
x2={'a':[10,11,12],'b':[13,14,15],'d':[16,17,18]}

df1=pd.DataFrame(x1,index=[1,2,3])
df2=pd.DataFrame(x2,index=[1,2,3])

pd.concat([df1,df2])

    a   b    c     d
1   1   4  7.0   NaN
2   2   5  8.0   NaN
3   3   6  9.0   NaN
1  10  13  NaN  16.0
2  11  14  NaN  17.0
3  12  15  NaN  18.0

In [ ]:
x1={'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
x2={'a':[10,11,12],'b':[13,14,15],'d':[16,17,18]}

df1=pd.DataFrame(x1,index=[1,2,3])
df2=pd.DataFrame(x2,index=[1,2,3])

pd.concat([df1,df2],axis=1)

   a  b  c   a   b   d
1  1  4  7  10  13  16
2  2  5  8  11  14  17
3  3  6  9  12  15  18

In [ ]:
df1=pd.DataFrame({'key1':[1,2,3],'a':[2,3,4],'b':[5,6,9]})
df2=pd.DataFrame({'key1':[1,2,4],'c':[1,2,5],'d':[4,8,2]})

In [ ]:
pd.merge(df1,df2)

   key1  a  b  c  d
0     1  2  5  1  4
1     2  3  6  2  8

In [ ]:
pd.merge(df1,df2,how='left')

   key1  a  b    c    d
0     1  2  5  1.0  4.0
1     2  3  6  2.0  8.0
2     3  4  9  NaN  NaN

In [ ]:
pd.merge(df1,df2,how='right')

   key1    a    b  c  d
0     1  2.0  5.0  1  4
1     2  3.0  6.0  2  8
2     4  NaN  NaN  5  2

In [ ]:
pd.merge(df1,df2,how='right',on='key1')

   key1    a    b  c  d
0     1  2.0  5.0  1  4
1     2  3.0  6.0  2  8
2     4  NaN  NaN  5  2

In [ ]:
df1=pd.DataFrame({'key1':[1,2,3],'a':[2,3,4],'b':[5,6,9]})
df2=pd.DataFrame({'key1':[1,2,4],'a':[1,2,5],'c':[4,8,2]})

In [ ]:
pd.merge(df1,df2,on='key1')

   key1  a_x  b  a_y  c
0     1    2  5    1  4
1     2    3  6    2  8

In [ ]:
x=pd.DataFrame({'a':[1,2,3,4,5],'b':[40,50,20,30,15]})
x

   a   b
0  1  40
1  2  50
2  3  20
3  4  30
4  5  15

In [ ]:
x.sort_values('b')

   a   b
4  5  15
2  3  20
3  4  30
0  1  40
1  2  50

In [ ]:
x=x.sort_values('b')
x

   a   b
4  5  15
2  3  20
3  4  30
0  1  40
1  2  50

In [ ]:
x['b'].unique()

array([15, 20, 30, 40, 50])

In [ ]:
x['b'].nunique() // number of unique

5

In [ ]:
x['b'].value_counts()

15    1
30    1
20    1
50    1
40    1
Name: b, dtype: int64

In [ ]:
x.isnull()

       a      b
4  False  False
2  False  False
3  False  False
0  False  False
1  False  False

In [ ]:
x.isnull().sum()

a    0
b    0
dtype: int64

In [ ]:
x.isnull().sum().sum()

0

In [31]:
x.head(2)

   a   b
4  5  15
2  3  20

In [32]:
x.tail(2)

   a   b
0  1  40
1  2  50

In [33]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 4 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      int64
 1   b       5 non-null      int64
dtypes: int64(2)
memory usage: 120.0 bytes

In [34]:
x

   a   b
4  5  15
2  3  20
3  4  30
0  1  40
1  2  50

In [37]:
y=x.loc[x['a']>2]
y

   a   b
4  5  15
2  3  20
3  4  30

In [ ]:
df = pd.DataFrame({
    "Name": ["A","B",
             "C"],
    "Age": [18,19,20],
    "Gender": ["Male","Female","Female"]
})

In [ ]:
df

  Name  Age  Gender
0    A   18    Male
1    B   19  Female
2    C   20  Female

In [ ]:
df['Age']

0    18
1    19
2    20
Name: Age, dtype: int64

In [ ]:
df.Age

0    18
1    19
2    20
Name: Age, dtype: int64

In [ ]:
df["Age"][0:2]

0    18
1    19
Name: Age, dtype: int64

In [ ]:
df.Age[:2]

0    18
1    19
Name: Age, dtype: int64

In [ ]:
max(df['Age'])

20

In [ ]:
min(df['Age'])

18

In [ ]:
df['Age'].max()

20

In [ ]:
df['Age'].min()

18

In [ ]:
df['Age'].mean()

19.0

In [ ]:
df.describe()

        Age
count   3.0
mean   19.0
std     1.0
min    18.0
25%    18.5
50%    19.0
75%    19.5
max    20.0